hwchaos/BETTA-HA-PANEL-ESP32-P4-WIFI6-Touch-LCD-4.3/sdkconfig.defaults.panel10
# SPDX-License-Identifier: LicenseRef-FNCL-1.1
# Copyright (c) 2026 Cpt_Kirk
#
# Panel variant overlay: 10.1" 1280x800 (Waveshare 10.1" MIPI-DSI).
# Apply together with the common sdkconfig.defaults via
#   idf.py -D SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.panel10" ...
# or the CMake preset "panel10" (see CMakePresets.json).

# --- SoC target ---
CONFIG_IDF_TARGET="esp32p4"

# --- Panel variant selector (drives app_config.h + display/touch init) ---
# CONFIG_APP_PANEL_VARIANT_4INCH_720 is not set
CONFIG_APP_PANEL_VARIANT_10INCH_1280=y

# PSRAM profile (Hex 200MHz) is shared across both variants and lives in
# sdkconfig.defaults. This overlay only carries 10.1"-specific tuning.

# (LV_USE_CLIB_MALLOC and MBEDTLS_SSL_IN_CONTENT_LEN=16384 live in the
#  common sdkconfig.defaults - both variants need them.)

# --- BSP display/touch: Waveshare 10.1" 800x1280 ---
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
# CONFIG_BSP_LCD_COLOR_FORMAT_RGB888 is not set
CONFIG_BSP_LCD_TYPE_800_1280_10_1_INCH=y
CONFIG_BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS=1500
CONFIG_ESP_LCD_TOUCH_MAX_POINTS=10
CONFIG_LV_USE_LODEPNG=y
